<template>
  <el-row justify="space-evenly">
    <el-col
        v-for="item in items"
        :key="item.id"
        :span= 4
        style="margin: 20px"
    >
      <el-link :underline="false">
        <el-card :body-style="{ padding: '0px' }" :shadow="'hover'">
          <el-image
              :src=getImageUrl(item.url)
              class="image"
              :fit="'cover'"
              style="height: 300px;width: auto"
          />
          <div style="padding: 14px">
            <span style="font-size: 20px">{{item.title}}</span>
            <div class="bottom">
            </div>
          </div>
        </el-card>
      </el-link>

    </el-col>
  </el-row>
</template>

<script setup>
import {onMounted, ref} from "vue";
  import {get} from "@/net";

  const items = ref()
  const items_= [
    {id:1, title:"大熊猫生长发育猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:2, title:"大熊猫历史", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"index_panda", author: "大熊猫研究中心"},
    {id:3, title:"大熊猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:1, title:"大熊猫生长发育猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:2, title:"大熊猫历史", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"index_panda", author: "大熊猫研究中心"},
    {id:3, title:"大熊猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:2, title:"大熊猫历史", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"index_panda", author: "大熊猫研究中心"},
    {id:3, title:"大熊猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:1, title:"大熊猫生长发育猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:2, title:"大熊猫历史", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"index_panda", author: "大熊猫研究中心"},
    {id:3, title:"大熊猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:2, title:"大熊猫历史", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"index_panda", author: "大熊猫研究中心"},
    {id:3, title:"大熊猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:1, title:"大熊猫生长发育猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:2, title:"大熊猫历史", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"index_panda", author: "大熊猫研究中心"},
    {id:3, title:"大熊猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"},
    {id:2, title:"大熊猫历史", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"index_panda", author: "大熊猫研究中心"},
    {id:3, title:"大熊猫生长发育", date: "2023-1-2", content: "刚出生：初生熊猫幼仔体重仅是它母亲体重的千分之一，平均体重仅120克左右，最轻的为51克，最重的为225克。粉色的皮肤上长着白毛，眼睛和耳朵还没有发育完全，免疫系统的也还未发育完", url:"panda1", author: "大熊猫研究中心"}
  ]
  function getImageUrl(name) {
    return new URL(`/src/img/${name}.jpg`, import.meta.url).href
  }
  const getItems = () => {
    get("url",() => {
      //获取数据
    }, () => {
      //失败返回error信息
    })
  }
const getItems_ = () => {
    items.value = items_
}
onMounted(() => {
  getItems_()
})

</script>

<style scoped>

</style>